tutorials/interFoam4PCMFoam/dynPCM/constant/PCMProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      PCMProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1//Oleic acid
{
    hm		hm [0 2 -2 0 0 0 0]	80600.0;
    Tm		Tm [0 0 0 1 0 0 0]	286.5;
    Tmr		Tmr [0 0 0 1 0 0 0]	1.0;
    Cu		Cu [1 -3 -1 0 0 0 0]	1.0e5;
    b		b [0 0 0 0 0 0 0]	1.0e-3;
}

phase2//Water
{
    hm		hm [0 2 -2 0 0 0 0]	83600.0;
    Tm		Tm [0 0 0 1 0 0 0]	273.0;
    Tmr		Tmr [0 0 0 1 0 0 0]	1.0;
    Cu		Cu [1 -3 -1 0 0 0 0]	1.0e5;
    b		b [0 0 0 0 0 0 0]	1.0e-3;
}


// ************************************************************************* //
